###############################################################
## Программа выбирает случайное число в диапазоне, установленном пользователем.
## Пользователь должен угадать данное число за заданное число попыток.
## после каждой попытки программа подсказывает, загаданное число меньше или больше
## введённого.
## Число попыток берётся, исходя из максимального числа шагов двоичного поиска
## для заданного диапазона.
###############################################################

import random
import math
minN = int (input ('Введите минимальное число диапазона:'))
maxN = int (input ('Введите максимальное число диапазона:'))
n = random.randint (minN, maxN)
p = math.ceil(math.log2(maxN-minN)) ## максимальное число попыток
x = 0
print ('Попробуйте угадать! Количество попыток: ' + str(p))
while x < p:
    x += 1
    d = int (input ('Попытка №' + str(x) + ':'))
    if d == n:
        print ('Вы угадали!')
        break
    elif d < n:
        print ('Не угадали! Число больше!')
    else:
        print ('Не угадали! Число меньше!')
print ('Вы использовали ' + str(x) + ' попыток. Загаданное число: ' + str(n))