###############################################################
## Ввести два числа с клавиатуры и, если они находятся в пределах таблицы умножения (10х10),
## вывести на экран результат их умножения. Если нет, то продолжать запрашивать числа, 
## пока пользователь не введет верные числа.
###############################################################

while True:
   a = float (input('Первое число: '))
   b = float (input('Второе число: '))
   if ((0 <= a <= 10) and (0 <= b <= 10)):
       x = a * b
       break
   print ('Числа вне диапазона.')
print (x)